In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("data/titanic/train.csv")

In [5]:
df.shape

(891, 12)

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df[df["Age"] > 70].head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C

In [6]:
df[["PassengerId", "Survived"]]

     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns]

In [7]:
df_older_class = df[(df["Age"] > 60) & (df["Pclass"] == 1)]

In [8]:
df[["Age", "Pclass"]]

      Age  Pclass
0    22.0       3
1    38.0       1
2    26.0       3
3    35.0       1
4    35.0       3
..    ...     ...
886  27.0       2
887  19.0       1
888   NaN       3
889  26.0       1
890  32.0       3

[891 rows x 2 columns]

In [9]:
df_older_class.shape

(14, 12)

In [10]:
df_older_class[["PassengerId", "Survived"]]

     PassengerId  Survived
54            55         0
96            97         0
170          171         0
252          253         0
275          276         1
438          439         0
456          457         0
493          494         0
545          546         0
555          556         0
625          626         0
630          631         1
745          746         0
829          830         1

#### 1. Lab: 사용자 입력 받아 처리하기

In [ ]:
def calc_fahrenheit(c_temp):
    fahr_temp = ((9 / 5) * c_temp) + 32
    return fahr_temp

print("본 프로그램은 섭씨를 화씨로 변환해주는 프로그램입니다.")

try:
    celcius = float(input("변환하고 싶은 섭씨 온도를 입력해 주세요: "))

    fahrenheit = calc_fahrenheit(celcius)
except Exception as e:
    print(f"다음과 같은 예외가 발생했습니다: {e}")
else:    
    print(f"섭씨온도 : {celcius: >5.2f}", f"화씨온도 : {fahrenheit: >5.2f}", sep = "\n")

#### 2. Lab: 학점 계산하기

In [ ]:
score_list = [38, 37, 7, 16, 95, 71, 63, 48, 49, 66, 37]

def eval_grade(score):
    if score >=90:
        grade = "A"
    elif score >= 80:
        grade = "B"
    elif score >= 70:
        grade = "C"
    elif score >= 60:
        grade = "D"
    else: 
        grade = "F"
    return grade

score_grade_dict = {}
for score in score_list:
    grade = eval_grade(score)
    score_grade_dict[score] = grade

print(score_grade_dict)

#### 3. Lab: 나이에 따른 학교 추정하기

In [ ]:
import datetime

def eval_enrollment(birth_year):
    cur_year = datetime.datetime.now().year
    age = (cur_year - birth_year) + 1

    if 26 >= age >= 20:
        enrollment = "대학생 입니다."
    elif 20 > age >= 17:
        enrollment = "고등학생 입니다."
    elif 17 > age >= 14:
        enrollment = "중학생 입니다."
    elif 14 > age >= 8:
        enrollment = "초등학생 입니다."
    else:
        enrollment = "학생이 아닙니다."

    return enrollment

print("당신이 태어난 년도를 입력하세요: ")
birth_year = int(input())

enrollment = eval_enrollment(birth_year)
print(enrollment)

#### 4. Lab: 구구단 출력하기

In [ ]:
print("구구단 몇 단을 계산할까요?")
dan = int(input())

print(f"구구단 {dan}단을 계산합니다.", sep = "\n")

for i in range(1, 10):
    t = dan * i
    print(f"{dan} X {i} = {t}")

### 5. Lab: 임의의 숫자 찾기

In [ ]:
import random

quiz_number = (random.randint(1, 100))

# print(quiz_number)

print("숫자를 맞춰보세요(1 ~ 100)", "포기하시려면 'Enter' Key를 누르세요", sep = "\n")

while (1):
    user_input_number = input()
    if (user_input_number ==""):
        print("숫자 찾기를 포기하셨습니다.",  f"찾는 숫자는 {quiz_number} 였습니다.", sep = "\n")
        break

    user_input_number = int(user_input_number)

    if (user_input_number > quiz_number):
        print("숫자가 너무 큽니다.")
    elif (user_input_number < quiz_number):
        print("숫자가 너무 작습니다.")
    else:
        print(f"정답입니다. 입력한 숫자는 {user_input_number} 입니다.")
        break

### 6. Lab: 구구단 연속 입력

In [ ]:

while (1):
    print("구구단 몇 단을 계산할까요(1 ~ 9)?")
    
    dan = int(input())

    if 1 <= dan < 10:
        print(f"구구단 {dan}을 계산합니다.")
        for i in range(1, 10):
            t = dan * i
            print(f"{dan} X {i} = {t}")
    elif dan == 0:
        print("구구단 게임을 종료합니다.")
        break
    else:
        pass

### 7. Lab: Yesterday 가사 중 Yesterday 단어 세기

In [10]:
f = open("data/yesterday.txt", "r")

yesterday_lyric = ""

while 1:
    line = f.readline()
    if not line:
        break
    yesterday_lyric += line.strip() + "\n"

f.close()

casefold_yesterday = "yesterday".casefold()
n_of_yesterday = yesterday_lyric.casefold().count(casefold_yesterday)
n_of_upper_yesterday = yesterday_lyric.count("Yesterday")
n_of_lower_yesterday = yesterday_lyric.count("yesterday") 
print(f"Number of Word \"{casefold_yesterday}\" {n_of_yesterday}.", 
      f"Number of Upper word \"Yesterday\" {n_of_upper_yesterday}.", 
      f"Number of Lower word \"yesterday\" {n_of_lower_yesterday}.", 
      sep = "\n")

Number of Word "yesterday" 5.
Number of Upper word "Yesterday" 0.
Number of Lower word "yesterday" 5.

### 8. Lab: 재귀함수를 for loop로 바꾸기

In [32]:
def factorial(n):
    if n == 1:
        return 1
    else:
        return n * factorial(n - 1)

def factorial_for(n):
    t = 1
    for i in range(1, n + 1):
        t *= i
    return t

n = 100
print(factorial(n))
print(factorial_for(n))

93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000
93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000

In [11]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,881,882,883,884,885,886,887,888,889,890
PassengerId,1,2,3,4,5,6,7,8,9,10,...,882,883,884,885,886,887,888,889,890,891
Survived,0,1,1,1,0,0,0,0,1,1,...,0,0,0,0,0,0,1,0,1,0
Pclass,3,1,3,1,3,3,1,3,3,2,...,3,3,2,3,3,2,1,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)","Allen, Mr. William Henry","Moran, Mr. James","McCarthy, Mr. Timothy J","Palsson, Master. Gosta Leonard","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Nasser, Mrs. Nicholas (Adele Achem)",...,"Markun, Mr. Johann","Dahlberg, Miss. Gerda Ulrika","Banfield, Mr. Frederick James","Sutehall, Mr. Henry Jr","Rice, Mrs. William (Margaret Norton)","Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen ""Carrie""","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"
Sex,male,female,female,female,male,male,male,male,female,female,...,male,female,male,male,female,male,female,female,male,male
Age,22.0,38.0,26.0,35.0,35.0,NaN,54.0,2.0,27.0,14.0,...,33.0,22.0,28.0,25.0,39.0,27.0,19.0,NaN,26.0,32.0
SibSp,1,1,0,1,0,0,0,3,0,1,...,0,0,0,0,0,0,0,1,0,0
Parch,0,0,0,0,0,0,0,1,2,0,...,0,0,0,0,5,0,0,2,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282,113803,373450,330877,17463,349909,347742,237736,...,349257,7552,C.A./SOTON 34068,SOTON/OQ 392076,382652,211536,112053,W./C. 6607,111369,370376
Fare,7.25,71.2833,7.925,53.1,8.05,8.4583,51.8625,21.075,11.1333,30.0708,...,7.8958,10.5167,10.5,7.05,29.125,13.0,30.0,23.45,30.0,7.75
Cabin,NaN,C85,NaN,C123,NaN,NaN,E46,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,B42,NaN,C148,NaN
Embarked,S,C,S,S,S,Q,S,S,S,C,...,S,S,S,S,Q,S,S,S,C,Q

#### 1. 1등실에 탑승한 승객 중 생존한 사람

In [26]:
df[(df["Survived"] == 1) & (df["Pclass"] == 1)].describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,136.000000,136.0,136.0,122.000000,136.000000,136.000000,136.000000
mean,491.772059,1.0,1.0,35.368197,0.492647,0.389706,95.608029
std,239.006988,0.0,0.0,13.760017,0.632412,0.690387,85.286820
min,2.000000,1.0,1.0,0.920000,0.000000,0.000000,25.929200
25%,307.750000,1.0,1.0,24.250000,0.000000,0.000000,50.985450
50%,510.500000,1.0,1.0,35.000000,0.000000,0.000000,77.958300
75%,693.500000,1.0,1.0,45.000000,1.000000,1.000000,111.481225
max,890.000000,1.0,1.0,80.000000,3.000000,2.000000,512.329200

#### 2. 1등실 외 탑승한 승객 중 사망한 사람

In [25]:
df[(df["Survived"] == 0) & (df["Pclass"] != 1)].describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,469.000000,469.0,469.000000,360.000000,469.000000,469.000000,469.000000
mean,453.279318,0.0,2.793177,28.302778,0.599147,0.334755,14.857141
std,261.726420,0.0,0.405460,12.641070,1.370195,0.842822,13.034647
min,1.000000,0.0,2.000000,1.000000,0.000000,0.000000,0.000000
25%,215.000000,0.0,3.000000,20.000000,0.000000,0.000000,7.775000
50%,462.000000,0.0,3.000000,26.500000,0.000000,0.000000,8.662500
75%,683.000000,0.0,3.000000,35.000000,1.000000,0.000000,16.100000
max,891.000000,0.0,3.000000,74.000000,8.000000,6.000000,73.500000

#### 3. 1등실 승객 중 사망한 사람

In [2]:
df[(df["Survived"] == 0) & (df["Pclass"] == 1)].describe()

NameError: name 'df' is not defined